<template lang="jade">
	div
		// MENU
		.wrap-menu
			.container-fluid
				.row
					.col-sm-12.text-left
						menu-component.menu--inline
		// - END MENU
		
		// - HEADER
		.wrap-header
			header-component
		// - END HEADER
		
		main
			.container
				.row
					.col-sm-12
						h1 Условия доставки и оплаты
			section.wrap-pages
				.container
					.row
						.col-sm-12
							article
								p Story.sale – интернет магазин качественных строительных материалов по доступным ценам. С доставкой по Москве и области.
								h3 Способы оплаты товара:
								p - <b><i>Онлайн оплата.</i></b> Оплата заказа с помощью банковских карт VISA/MASTERCARD или электронных денег на сайте. После оформления заказа Вам на почту придет ссылка на защищенную страницу оплаты процессинговой системы, которая прошла международную сертификацию. Это значит, что Ваши конфиденциальные данные (реквизиты карты, регистрационные данные и др.) не поступают в интернет-магазин, их обработка полностью защищена. <br> - <b><i>Банковским переводом.</i></b> Оплата производится в отделении банка по выписанному счёту, либо через личный кабинет Вашего интернет банка. Счет придет Вам на почту после оформления заказа. Рекомендуемый способ при больших суммах.<br> - <b><i>Наличными при получении.</i></b> Оплата за наличный расчет при получении заказа на складе самовывоза или при доставке. При данном способе оплаты, карты не принимаются.<br> - <b><i>Безналичная оплата по выставленному счету.</i></b>Рекомендуемый способ оплаты для юридических лиц.<br>
								h3 Способы получения товара:
								p -<b><i>доставка до дома/офиса/дачи</i></b>.Товары готовы к доставке через один рабочий день после оформления заказа. Заказать доставку можно на любой день, без выходных, с 8-00 до 00-00.<br> - <b><i>самовывоз со склада магазина</i></b>.Товары готовы к  отгрузке через один рабочий день после оформления заказа. Отгрузки осуществляются в любой день, без выходных, с 8-00 до 22-00. Адрес склада указан в разделе контакты.
								p Стоимость доставки рассчитывается курьерской службой исходя из базовых тарифов и озвучивается по телефону менеджером. Оплата доставки осуществляется при получении товара.
								h3 Правила и стоимость доставки
								p Доставка приобретенного товара производится до подъезда, дачи, коттеджа при наличии подъездных путей для грузовых автомобилей, в пределах Москвы и Московской области.
								p Доставка товара осуществляется с 08:00 до 00:00 ежедневно, без выходных. Совершая заказ, Вы можете выбрать удобную для Вас дату.  Если Вы отсутствуете в назначенное время доставки, то экспедиторы ждут Вас в течение 20 минут, после чего уезжают, оставляя уведомление об отсутствии покупателя. Разгрузка, а также транспортировка груза до квартиры оплачивается дополнительно.
								p При оформлении доставки необходимо корректно предоставить следующую информацию: номер дома(а также строение и корпус); подъезд; номер квартиры; код в подъездную дверь; этаж; лицо, ответственное за прием товара.
								h3 Тарифы на доставку
								table
									tr
										td <strong>Весовой товар</strong>
										td <strong>До 200кг</strong>
										td <strong>До 1000кг</strong>
										td <strong>До 1500кг</strong>
										td <strong>До 3500кг</strong>
									tr
										td По Москве в пределах МКАД, руб.
										td 700 руб.
										td 1900 руб.
										td 2500 руб.
										td 3800 руб.
								p На все товары из интернет магазина story.sale действуют гарантийные обязательства, предусмотренные заводами-производителями стройматериалов.
						
	
		
		
		// SUBSCRIBE
		//.wrap-subscribe
			Subscribe
		// FOOTER
		.wrap-foooter
			footer-component
</template>

<script>
	import MenuComponent   from '../../modules/MenuModules/index.vue'
	import HeaderComponent from '../../modules/HeaderModules/index.vue'
	import Subscribe       from '../../modules/SubscribeModules/index.vue'
	import FooterComponent from '../../modules/FooterModules/index.vue'

	export default {
		name: 'DeliveryPage',
		props: [
		],
		components: {
			MenuComponent,
			HeaderComponent,
			Subscribe,
			FooterComponent,
		},
		data : function () {
			return {

			}
		}
	}
</script>
