[
  {
    "name": "Шпатлевка полимерная МАГМА 'FINISH LR', 20 кг (аналог Weber.Vetonit LR+)",
    "price": "385",
    "sale": "0.05",
    "img": "img/catalog2/28.jpg",
    "description1": " Толщина слоя  до 3 мм. Адгезия - не менее 0,5 МПа. Цвет белый.",
    "description2": "Для суперфинишного шпаклевания вертикальных и горизонтальных оснований внутри помещений с нормальной влажностью и температурой. Идеально белая и гладкая поверхность, пластичная, безусадочная и трещиностойкая. Является полным аналогом  Weber.Vetonit LR+!",
    "number": "200120"
  },
  {
    "name": "Шпатлевка гипсовая финишная МАГМА 'EcoFiller'   ",
    "price": "295",
    "sale": "0",
    "img": "img/catalog2/29.jpg",
    "description1": "Толщина слоя 2- 5 мм. Адгезия - не менее 0,5 МПа. Цвет белый.",
    "description2": "Не требует грунтования! Для финишного шпаклевания вертикальных и горизонтальных оснований внутри помещений с нормальной влажностью и температурой, заделки стыков между ГКЛ и ГЛВ, заделки дефектов пазогребневых плит и гипсовых блоков. Идеально белая и гладкая поверхность, пластичная, безусадочная и трещиностойкая.",
    "number": "200121"
  },
  {
    "name": "Шпатлевка полимерная финишная HAGA ST KR - 505, 20 кг",
    "price": "385",
    "sale": "0",
    "img": "img/catalog2/1.jpg",
    "description1": "Адгезия – 0,5 МПа. Слой нанесения 0.3-3 мм. Расход смеси при слое 1 мм - 0,8-0.9 кг/м²",
    "description2": "Предназначена для финишных работ, внутри отапливаемых помещений с нормальным уровнем влажности. Обладает высокой пластичностью и укрывистостью.",
    "number": "200122"
  },
  {
    "name": "Гипсовая универсальная шпатлевка HAGA ST KITT PG-504, 20 кг",
    "price": "248",
    "sale": "0",
    "img": "img/catalog2/9.jpg",
    "description1": "Адгезия – 0,4 МПа. Слой нанесения 1-5 мм. Расход смеси при слое 1 мм - 0,9 кг/м²",
    "description2": "Для финишного выравнивания поверхностей внутри помещений под окраску и отделку, заделки швов ГКЛ и ГВЛ.",
    "number": "200123"
  },
  {
    "name": "Шпатлевка цементная HAGA ST PUTTY PS-620, 20 кг",
    "price": "365",
    "sale": "0",
    "img": "img/catalog2/24.jpg",
    "description1": "Адгезия   не менее – 0,5 МПа. Толщина слоя 1-5 мм. Расход при толщине слоя 1 мм  – 1 кг/м².",
    "description2": "Для наружных и внутренних работ. Для выравнивания поверхностей фасадов зданий, а также, для финишной отделки стен внутри влажных и не отапливаемых помещений. ",
    "number": "200124"
  }
]