[  {
    "name": "Клей для керамической плитки  HAGA ST  KAS-511, 25 кг",
    "price": "168",
    "sale": "0.05",
    "img": "img/catalog2/6.jpg",
    "description1": " Адгезия - 0,5 Мпа. Вес удерживаемой плитки до 350 гр/100см2. Расход смеси под шпатель 6 мм - 3,5 кг/м2.",
    "description2": "Для наружных и внутренних работ. Облицовка керамической плиткой стандартного размера и приклеивания  легкого камня в сухих и влажных помещениях. ",
    "number": "200210"
  },
  {
    "name": "Клей плиточный МАГМА 'Базовый' , 25 кг",
    "price": "198",
    "sale": "0",
    "img": "img/catalog2/57.jpg",
    "description1": "Для помещений любой влажности и наружных работ. Удерживаемый вес плитки до 200 г/100 см². Адгезия - не менее 0,5 Мпа",
    "description2": "Для всех типов керамической и кафельной плитки малых и средних размеров.  Предназначен для облицовки вертикальных и горизонтальных оснований, тонкослойной укладки блоков из всех типов ячеистых бетонов с толщиной клеевого шва 2-5 мм. ",
    "number": "200211"
  },
  {
    "name": "Клей для керамогранита, натурального камня и керамической плитки HAGA ST KAS-540",
    "price": "250",
    "sale": "0",
    "img": "img/catalog2/67.jpg",
    "description1": "Применяется для системы 'Теплый пол'. Адгезия - 1,25Мпа. Вес удерживаемой плитки до 1200 гр/100 см2. Расход смеси под шпатель 6 мм - 3,5 кг/м2.",
    "description2": "Для наружных и внутренних работ. Для укладки на пол и стены всех видов керамической плитки и облицовки керамогранитов и натуральным камнем. Используется для облицовки балконов, террас, цоколей, фасадов, эксплуатируемых кровель и помещений с любым уровнем влажности, для облицовки искуственных водоемов  и чаш бассейнов и работе по сложным основаниям.  ",
    "number": "200212"
  },
  {
    "name": "Белый клей для мрамора, мозаики и натурального камня HAGA ST KAS-545​, 25 кг ",
    "price": "385",
    "sale": "0",
    "img": "img/catalog2/59.jpg",
    "description1": "Адгезия - 1,25  МПа. до 1200 г/100 см2 (120 кг/м2). Расход  смеси под шпатель 6 мм - 3,5 кг/м2.",
    "description2": "Белый клей для мозаики, стекла и мрамора ТМ «HAGA ST» KAS-545 отлично подходит для крепления всех видов мозаики, облицовочных материалов и декоративных элементов из белого мрамора, стекла, натурального и искусственного камня светлых и полупрозрачных тонов, керамогранита. Применяется при проведении наружных и внутренних облицовочных работ, в том числе при строительстве искусственных водоемов, чаш бассейнов, бани и сауны, эксплуатируемой кровли, при устройстве систем «ТЕПЛЫЙ ПОЛ».",
    "number": "200213"
  }
]