[
  {
    "name": "Праймер битумный 'Профи', 10 л",
    "price": "460",
    "sale": "0",
    "img": "img/catalog2/54.jpg",
    "description1": "Праймер серии ПРОФИ отличается более низкой вязкостью, быстрым временем высыхания,высокой степенью сцепления с обрабатываемой поверхностью и удобством при нанесении(возможно нанесение через механическое напыление). В состав праймера серии ПРОФИ входят высококачественные битумы и растворители.",
    "description2": "Предназначен для грунтования бетонных плит, цементно-песчаной стяжки, перед укладкой наплавляемых и самоклеящихся кровельных и гидроизоляционных материалов. Обеспечивает качественное приклеивание гидроизоляционных материалов к пористым, шероховатым и пыльным поверхностям с помощью глубокопроникающего средства. ",
    "number": "200710"
  },  {
    "name": "Мастика битумная 'Профи', 10 л",
    "price": "420",
    "sale": "0",
    "img": "img/catalog2/55.jpg",
    "description1": "0",
    "description2": "Мастика ПРОФИ предназначена для гидроизоляционных работ, устройства и ремонта кровли, антикоррозийной защиты бетонных,металлических, деревянных и других конструкций,в том числе трубопроводов. Используется для приклеивания различных строительных материалов (пергамин, гидростеклоизол и т.п). ",
    "number": "200711"
  },  {
    "name": "Гидроизоляция обмазочная HAGA ST GIDROCUT W7, 20 кг ",
    "price": "650",
    "sale": "0",
    "img": "img/catalog2/56.jpg",
    "description1": "Слой нанесения 1-5 мм. Сопротивление прямому давлению воды - до 7 атм., обратному - до 2 атм. Расход - от 1,2 кг/м.кв.",
    "description2": "Для создания герметичного водонепроницаемого слоя жесткого типа при устройстве гидроизоляционных систем, капиллярных отсечек и защитных покрытий при проведении наружных и внутренних работ.",
    "number": "200712"
  },  {
    "name": "Рубероид РПП-300-0(о), 15 м2",
    "price": "270",
    "sale": "0",
    "img": "img/catalog2/65.jpg",
    "description1": "0",
    "description2": "Используется для гидроизоляции  путем приклеивания на битумную мастику (холодный способ), на горячий битум или при помощи механической фиксации",
    "number": "200713"
  },
]