[
    {
        "name":" Шпаклёвка полимерная финишная Weber Vetonit LR Plus, 20 кг",
        "price":"564",
        "sale":"0.25",
        "description":"Скидка 25%! Распродажа товарных остатков до 20 августа!",
        "image":"img/target/main2--small.jpg",
        "position":"0",
        "amount":"руб",
        "text": "Виды работ: для перегородок, потолка, стен. Материал основания:Бетон, Гипсокартон, Штукатурка.Тип финишного покрытия: Под обои, Под покраску. Тип шпатлевки: Финишная. Связующее вещество: Полимерная. Наполнитель: Мрамор. Цвет: Белый. Время высыхания слоя: 24 ч. Минимальная толщина слоя: 1 мм. Максимальная толщина слоя: 5 мм. Размер зерна: 0,3 мм.",
        "text2": "Шпатлевка Weber.Vetonit LR+ - финишная шпатлевка для отделки потолков и стен внутри помещений. Шпатлевка изготавливается на основе полимерного клеевого связующего вещества идеально белого цвета.  Высокое качество сделало ветонит лр+ абсолютным лидером среди шпатлевок смесей.",
        "number": "Арт: 923001221"
    },
    {
        "name":" Гипсовая штукатурка Ротбанд KNAUF 30кг, серая ",
        "price":"245",
        "sale":"0.25",
        "price__lerua":"370",
        "price__obi":"384","price__krauta":"",
        "price__kastorama":"",
        "price__middle":"",
        "description":"Скидка 25%! Распродажа товарных остатков до 20 августа!",
        "image":"img/target/main1--small.jpg",
        "position":"99",
        "amount":"руб",
        "text": "Цвет: Серый. Тип применения: Для внутреннего применения. Материал основания: Бетон, Газобетон, Кирпич, Штукатурка. Расход воды на мешок: 18 л. Рекомендуемая толщина слоя: 5-50 мм. Температура применения: +5 - +30 C. Влагостойкость:  Да. Размер зерна: 1,2 мм",
        "text2": "Ротбанд - универсальная сухая штукатурная смесь на основе гипсового вяжущего с полимерными добавками, обеспечивающими повышенную адгезию. Высокое качество сделало ротбанд абсолютным лидером среди штукатрных смесей. Отличный выбор для оштукатуривания стен и потолков с любым типом поверхности.",
        "number": "Арт: 923001220"
    },
    {
        "name":"Гипсовая универсальная штукатурка HAGA ST PUTZ GS-402, 30 кг (аналог Knauf Ротбанд)",
        "text":" Адгезия, не менее - 0,5 МПа. Слой нанесения – 5-30 мм. Расход при толщине слоя 10мм: 9-10 кг/м2. Для ручного нанесения, для машинного нанесения.",
        "text2":"Для выравнивания поверхностей стен и потолков внутри помещений с нормальной влажностью под  последующие отделочные работы. При мокром затирании, возможно получение гладкой поверхности, не требующей дальнейшего шпатлевания. Является полным аналогом Knauf Ротбанд!",
        "price":"268",
        "sale":"0.05",
        "image":"img/target/21.jpg",
        "position":"1",
        "number": "Арт: 923001222"
    },
    {
        "name":"Цементная штукатурка серая для ручного и машинного нанесения HAGA ST AUBENPUTZ FS-410, 25 кг",
        "text":" Адгезия не менее – 0,4 МПа. Слой нанесения 3-30 мм. Расход при толщине слоя 10 мм  – 15  кг/м².",
        "text2":"Для наружных и внутренних работ  под последующее финишное выравнивание поверхностей, для отделки фасадов зданий, цоколей и помещений с повышенным уровнем влажности.",
        "price":"208",
        "sale":"0.05",
        "image":"img/target/8.jpg",
        "position":"2",
        "number": "Арт: 923001223"
    },
    {
        "name":"Бетоноконтакт серии универсал, 10 кг",
        "text": [],
        "text2":"Адгезионный сцепляющий грунт с кварцевым наполнителем для внутренних и наружных работ. Бетоноконтакт применяется для обработки слабо впитывающих оснований (монолитного бетона, бетонных потолков, зашлифованных бетонных блоков, перед нанесением всех видов цементных и гипсовых штукатурок.",
        "price":"620",
        "sale":"0.05",
        "image":"img/target/2.jpg",
        "position":"3",
        "number": "Арт: 923001224"
    },
    {
        "name":"Грунт глубокого проникновения акриловый ПРОФИ, 10л",
        "text": [],
        "text2":"Грунт акриловый профессиональный для внутренних и наружных работ. Применяется перед штукатуркой и шпатлевкой, покраской. Обеспечивает высокую адгезию, антисептические и глубокопроникающие свойства. Предназначен для обработки гипсосодержащих, бетонных, кирпичных, волокнисто-цементных и прочих поверхностей.",
        "price":"396",
        "sale":"0.05",
        "image":"img/target/3.jpg",
        "position":"4",
        "number": "Арт: 923001225"
    },
    {
        "name":"Грунт акриловый универсальный, 10л",
        "text": [],
        "text2":"Грунт акриловый универсальный для внутренних и наружных работ. Дляобработки гипсосодержащих и волокнисто-цементных оснований, готовых штукатурок, известкового песчаника и кирпичной кладки, ДСП, ДВП, картона, изолирующих обоев, наливных полов.",
        "price":"199",
        "sale":"0",
        "image":"img/target/4.jpg",
        "position":"5",
        "number": "Арт: 923001226"
    },
    {
        "name":"Профили маячковые (маяки штукатурные) оцинкованные , 6 мм, длина 3м ",
        "text": [],
        "text2":"Маяки значительно уменьшают время на проведение штукатурных работ. Жесткий профиль не подвержен деформациям, а специальные отверстия по всей длинне позволяют крепить профиль шпаклевкой и саморезами Профили из оцинкованной стали можно использовать как съемный и как постоянный элемент в устройстве поверхностей",
        "price":"24",
        "sale":"0.05",
        "image":"img/target/5.jpg",
        "position":"6",
        "number": "Арт: 923001227"
    },
    {
        "name":"Клей для керамической плитки  HAGA ST  KAS-511, 25 кг",
        "text":" Адгезия - 0,5 Мпа. Вес удерживаемой плитки до 350 гр/100см2. Расход смеси под шпатель 6 мм - 3,5 кг/м2",
        "text2":"Для наружных и внутренних работ. Облицовка керамической плиткой стандартного размера и приклеивания  легкого камня в сухих и влажных помещениях. ",
        "price":"168",
        "sale":"0.05",
        "image":"img/target/6.jpg",
        "position":"7",
        "number": "Арт: 923001228"
    },
    {
        "name":"Универсальный быстротвердеющий наливной пол HAGA ST HAGA PLAST, 20 кг",
        "text":"Время до пешего хождения  - 4 часа. Полный набор прочности - 24 часа. Слой нанесения  2-100 мм. Прочность на сжатие-15 МПа. Расход при толщине слоя 10 мм  – 15 кг/м²",
        "text2":"Для базового или финишного устройства оснований под последующее нанесение выстилающих покрытий. Для ручного и машинного нанесения.",
        "price":"240",
        "sale":"0.05",
        "image":"img/target/7.jpg",
        "position":"8",
        "number": "Арт: 923001229"
    },
    {
        "name":"Гипсовая универсальная шпатлевка HAGA ST KITT PG-504, 20 кг",
        "text":"Адгезия – 0,4 МПа. Слой нанесения 1-5 мм. Расход смеси при слое 1 мм - 0,9 кг/м²",
        "text2":"Для финишного выравнивания поверхностей внутри помещений под окраску и отделку, заделки швов ГКЛ и ГВЛ.",
        "price":"260",
        "sale":"0.05",
        "image":"img/target/9.jpg",
        "position":"9",
        "number": "Арт: 923001230"
    },
    {
        "name":"КЛЕЙ ДЛЯ СТЕКЛООБОЕВ, виниловых обоев, ВОДОСТОЙКИЙ ЛАТЕКСНЫЙ, 10 л",
        "text": [],
        "text2":"Предназначен для приклеивания стеклообоев, виниловых и любых видов тяжелых обоев, линолеума из ПВХ на теплоизолирующей подоснове, ковролина, бордюра, потолочных плиток из пенополистирола, вспененного ПВХ, декоративных поливинилхлоридных материалов. Для стен на основе из бетона, дерева и других видов подложек.",
        "price":"685",
        "sale":"0",
        "image":"img/target/10.jpg",
        "position":"10",
        "number": "Арт: 923001231"
    },
    {
        "name":"КРАСКА СУПЕРБЕЛАЯ АКРИЛОВАЯ ВОДНО-ДИСПЕРСИОННАЯ, 14 кг",
        "text":"Высокие декоративные свойства, паропроницаемость, светостойкойсть, долговременная защита поверхности от поражения плесенью, экологичность. Расход: на однослойное покрытие 150-200 г/м2. Время полного высыхания 3 часа..",
        "text2":"Предназначена для высококачественной окраски потолков и стен внутри жилых и нежилых помещений. Идеально подходит для отделки минеральных поверхностей, дерева, гипсокартона, гипса, струкрутным обоям, стекловолокну.",
        "price":"488",
        "sale":"0",
        "image":"img/target/11.jpg",
        "position":"11",
        "number": "Арт: 923001232"
    },
    {
        "name":"Мешки для строительного мусора полипропиленовые 95х55, 10 шт, повышенная прочность",
        "text": [],
        "text2":"Предназначены для утилизации строительных отходов, а так же хранения сыпучих непещевых материалов таких как песок, щебень и т.д.",
        "price":"98",
        "sale":"0",
        "image":"img/target/12.jpg",
        "position":"12",
        "number": "Арт: 923001233"
    },
    {
        "name": "Серпянка STAYER - сетка стеклотканевая, самоклеящаяся 2,85 х 2,85, ширина 50 мм, длина 45 м",
        "text": "Изготовлена из стеклоткани. Не подвержена растяжению Липкий клеящий слой",
        "text2": "Предназначена для укрепления стыков гипсокартона, гипсоволокна, армирования стыков и трещин.",
        "price": "165",
        "sale": "0",
        "image": "img/target/13.jpg",
        "position": "13",
        "number": "Арт: 923001234"
    },
    {
        "name":"Серпянка (стеклосетка) «ЗУБР» - сетка стеклотканевая малярная  (ячейка 5х5) 100 см",
        "text":"Длина - 10 м. Изготовлена из стеклоткани. Не подвержена растяжению. Устойчивость к воздействию щелочей. Для работы с цементом НЦ и «Гидро-S», любыми видами штукатурок и клеевых смесей",
        "text2":"Предназначена для армирования штукатурных растворов, гидроизолирующих покрытий, при соединении материалов с различными коэффициентами теплового расширения. Используется для придания механической прочности самовыравнивающимся наливным полам.",
        "price":"445",
        "sale":"0",
        "image":"img/target/14.jpg",
        "position":"14",
        "number": "Арт: 923001235"
    },
    {
        "name":"Мастерок штукатура (кельма) с деревянной усиленной ручкой, 190 мм, Сердце",
        "text": [],
        "text2":"Кельмы строительные предназначены для отмеривания материалов, перемешивания растворов, нанесения на обрабатываемую поверхность штукатурно-отделочных составов, кладки кирпича.",
        "price":"98",
        "sale":"0",
        "image":"img/target/15.jpg",
        "position":"15",
        "number": "Арт: 923001236"
    },
    {
        "name":"Правила «СИБИН» алюминиевые, профиль-трапеция 1,5м",
        "text": [],
        "text2":"Изготовлено из алюминиевого сплава повышенной прочности. Предназначено для выравнивания горизонтальных и вертикальных поверхностей при выполнении штукатурных работ.",
        "price":"289",
        "sale":"0",
        "image":"img/target/16.jpg",
        "position":"16",
        "number": "Арт: 923001237"
    },
    {
        "name":"Правила «СИБИН» алюминиевые, профиль-трапеция 2м",
        "text": [],
        "text2":"Изготовлено из алюминиевого сплава повышенной прочности. Предназначено для выравнивания горизонтальных и вертикальных поверхностей при выполнении штукатурных работ.",
        "price":"398",
        "sale":"0",
        "image":"img/target/16.jpg",
        "position":"17",
        "number": "Арт: 923001238"
    },
    {
        "name":"Шпатель стальной нержавеющий СИБИН, 100 мм",
        "text": [],
        "text2":"Стальные строительные шпатели «СИБИН» предназначены для нанесения и выравнивания строительных смесей при проведении малярных и штукатурных работ.",
        "price":"85",
        "sale":"0",
        "image":"img/target/17.jpg",
        "position":"18",
        "number": "Арт: 923001239"
    },
    {
        "name":"Шпатель нержавеющий «ЗУБР» с двухкомпонентной ручкой, 80 мм",
        "text": [],
        "text2":"Шпатели нержавеющие ЗУБР предназначены для нанесения и выравнивания строительных смесей на обрабатываемых поверхностях большой площади.",
        "price":"160",
        "sale":"0",
        "image":"img/target/18.jpg",
        "position":"20",
        "number": "Арт: 923001240"
    },
    {
        "name":"Стальные гладилки «ЗУБР» с пластмассовой ручкой 130 х 280",
        "text":"Размер - 130 х 280. Форма - Прямая",
        "text2":"Штукатурные гладилки стальные ЗУБР предназначены для нанесения и разравнивания штукатурных смесей.",
        "price":"198",
        "sale":"",
        "image":"img/target/20.jpg",
        "position":"21",
        "number": "Арт: 923001241"
    },
    {
        "name":"Гладилка стальнае зубчатая STAYER, серия MASTER  130 х 280 мм (4х4, 6х6, 8х8)",
        "text":[],
        "text2":"Штукатурные гладилки стальные STAYER предназначены для нанесения и распределения по поверхности штукатурных смесей и клеевых растворов.",
        "price":"230",
        "sale":"0",
        "image":"img/target/19.jpg",
        "position":"22",
        "number": "Арт: 923001242"
    },
    {
        "name":"Клей для газосиликатных, пенобтонных блоков HAGA  KAS-510, 25 кг",
        "text":"Адгезия - 0,5 МПа. Расход - 15-18кг/м3.",
        "text2":"Для наружных и внутренних работ. Тонкослойная кладка стен и перегородок из газосиликатных и пенобетонных блоков, блоков из ячеистого пенополистиролбетона и т.п. ",
        "price":"170",
        "sale":"0",
        "image":"img/target/22.jpg",
        "position":"23",
        "number": "Арт: 923001243"
    },
    {
        "name":"Монтажно-клеевой состав гипсовый для пазогребневых плит и гипсокартона HAGA ST MONTERAL RMG-140, 30 кг. Новинка!",
        "text":"Слой нанесения 1-40 мм. Адгезия не менее 0,5 МПа. Расход от 0,9 кг/м2.",
        "text2":"Для монтажа гипсовых плит ПГП, панелей и блоков, бескаркасного монтажа листов ГКЛ, ГВЛ, крепления тепло- и звукоизоляционных плит из пенополистирола и минеральной ваты, декоративных элементов интерьера и гипсовых облицовочных материалов.",
        "price":"258",
        "sale":"0",
        "image": "img/target/23.jpg",
        "position":"24",
        "number": "Арт: 923001244"
    },
    {
        "name":"Шпатлевка цементная HAGA ST PUTTY PS-620, 20 кг",
        "text":"Адгезия   не менее – 0,5 МПа. Толщина слоя 1-5 мм. Расход при толщине слоя 1 мм  – 1 кг/м².",
        "text2":"Для наружных и внутренних работ. Для выравнивания поверхностей фасадов зданий, а также, для финишной отделки стен внутри влажных и не отапливаемых помещений.",
        "price":"365",
        "sale":"0",
        "image":"img/target/24.jpg",
        "position":"25",
        "number": "Арт: 923001245"
    }
]