<template lang="jade">
    .container.blog-wp
        .row(v-if="allPost").allPost
            .col-sm-12
                h2.text-center Блог
                .blog-posts(:key="item.id", v-for="(item,index) in blogpostsArray")
                    div(@click="clearArea")
                        router-link(:to="{name: 'blogpost', params: {id: index}}", class="blog-posts__link" ) {{item.date}} - {{item.title}}
                    br
                    {{item.text | textLength}}
        .row(v-if="allPost==false")
            .col-sm-12.text-center
                a.allPost-link(href="/#/blog/", @click="allPost=true" title="title") Все заметки 
        router-view(:post="blogpostsArray")

</template>

<script>
    import blogpost   from './blogpost.vue'
    module.exports = {
        name : 'blog',
        components : { blogpost },
        props : [],
        data : function() {
            return {
                blogpostsArray : [
                    {   
                        date : '05.05.2017',
                        title : 'Каждый кто собирается делать ремонт должен знать это! 5 заповедей, которые спасут Ваш кошелек!',
                        text : `
                            <img src="img/11.jpg" width="650" class="center" alt="" /><br><br>
                            <p>Добро пожаловать! Если Вы посчитали стоимость ремонта своей квартиры/дома и ужаснулись… Спокойно! Этот блог для Вас!</p>

                            <p>Не стоит переживать. Ведь на многом, очень многом в ремонте реально сэкономить. При этом, не потерять в качестве и сделать внешний вид жилища достойным.</p>

                            <p>Герой нашего блога – Игорь. Типичный сварщик из Царицыно со среднемесячным доходом 70-80 тысяч рублей. Два года Все заметки он купил участок земли на юге Московской области. И поставил амбициозную цель – построить дом. И не просто построить, а сделать это в два раза дешевле рыночных цен. В 2 РАЗА. Скажете это не реально?</p>

                            <p>В блоге посмотрим, как у него это получится. Попутно расскажем лайвхаки экономного строительства и ремонта. От фундамента и благоустройства до отделки и интерьера. Никакой воды. Только конкретные расчеты, сравнения и результаты. Сразу оговоримся, статьи будут выходить не в хронологическом порядке строительства. Чтобы читатели и по ремонту квартир и по строительству домов нашли для себя что то полезное. А итоги по завершении стройки, будем подводить в режиме реального времени.</p>
                            <br><br>
                            <img src="img/12.jpg" width="650" class="center" alt="" />
                            <br><br>
                            <p>Итак, участок куплен. Цель поставлена. Игорь сидит в поле и мысленно размещает дом на участке. Но для начала стоит определиться с общими принципами. За счет чего будем экономить?</p>
                            <br><br>
                            <h4 class="text-center">Принципы экономного строительства/ремонта:</h4>
                            <br>
                            <b><p>1) Максимум работ своими руками</b><br>
                            Стоимость строительства/ремонта дома «под ключ» примерно поровну делится на стоимость материалов и стоимость работ. Если мы хотя бы половину работы выполним собственными силами, то в конечной стоимости дома экономия составит около 25%. У Игоря руки растут из правильных мест. Хоть он и не является профессиональным строителем, с радостью принимает этот вызов. Мужик!
                            <br><br>
                            <b>2) Выгодные закупки материалов</b><br>
                            Вторая половина в конечной стоимости дома – это материал. Чтобы сэкономить еще 25%, нужно закупить стройматериалы за полцены от розницы. Реально? Вполне! В блоге расскажем, как скупать материал на акциях и распродажах в гипермаркетах. А также научимся пользоваться сайтом  по покупке стройматериалов со скидками stroy.sale. 
                            <br>
                            <img src="img/13.jpg" width="650" class="center"  alt="" />
                            <br>
                            Дело в том, что у профессиональных строительных компаний на крупных объектах образуется огромное количество остатков материала. Совершенно новых. Ведь посчитать все с точностью до гвоздя невозможно. Также у производителей, оптовиков на складах образуются  остатки и неликвиды. С помощью сервиса stroy.sale они продают эти материалы физлицам. Например, Игорю. По ценам ниже рыночных на 50%, а зачастую и до 70-80%.
                            <br><br>
                            <b>3) Минимальная отходность материалов</b><br>
                            Что такое отходность? Это обрезки и остатки материала, непригодные для использования. Удивительно, но в среднем на отходы уходит до 25%, а при неграмотном подходе и все 30% материала. Целых 30%! Игорь поставил разумную задачу – свести отходность к 7-10%. В блоге расскажем, как не выбросить на помойку 30% бюджета.
                            <br><br>
                            <b>4) Максимальное использование материалов Б/У</b><br>
                            Многие пренебрегают материалами Б/У как вариант экономии в строительстве. Однако, советуем не быть категоричными. При грамотном подходе, можно применить Б/У без потерь в качестве ремонта. Стоимость же подобных материалов дешевле новых на 50-80%. Например, можно частично выложить дом/гараж/хозпостройки из кирпича Б/У; поставить забор из профлиста, который уже использовался как временное ограждение; поставить плиту перекрытия, которую демонтировали с другого здания. Главное! Подходить к применению Б/У с умом. И тщательно выбирать материал.
                            <br><br>
                            <b>5) Применение максимально простых технических решений</b><br>
                            Нужно исключить из строительства технологии, требующие применения профессиональной техники и дорогостоящего оборудования. А также использовать только традиционные материалы. Всё, что проверено временем.</p>
                            <p>Фух, звучит неплохо. Посмотрим, что из этого выйдет. В следующих статьях будем огораживать участок и узнаем как дешево купить плитку. А на сегодня всё. Не переплачивайте за ремонт и удачи!</p>
                            <br><br>
                            <img src="img/14.jpg" width="650" class="center" alt="" />
                            <br><br>
                             `
                    },
                    {
                        date : '8.06.2017',
                        title : 'Хитрый забор из профлиста. Огораживаем участок на 60% дешевле!',
                        text : 
                        `
                        <img src="img/21.jpg" width="650" class="center" alt="" />
                        <br><br>
                        <p>Счастливый владелец участка в Московской области – Игорь. И по совместительству герой нашего блога. Ведь он поставил интересную цель - построить дом в два раза дешевле рыночных цен. И первым делом после покупки, Игорь решил поставить на участке ограждение. Вот что он думал на этот счет:
                        <br><br>
                        <b>1)</b> Забор должен по всему периметру быть сплошным. Никакой сетки-рабицы или штакетника. Не то чтобы Игорь скрывался от соседей или собирался делать что то противозаконное) Все же на своем участке свободнее чувствуешь себя за сплошным ограждением.
                        <br>
                        <b>2)</b> Забор с уличной стороны участка будет временным. Впереди еще много работ –грузовая техника, строители, коммуникации и тд. Все это может повредить ограждение. Спокойствие дороже.
                        <br>
                        <b>3)</b> В качестве материала для забора выбираем простой и проверенный временем материал – профлист. Он доступен в цене и не требует специальных навыков в монтаже. Плюс, не забываем, что Игорь сварщик. Профлист посадим на металлический каркас из забетонированных вертикальных столбов и горизонтальных реек. Со временем лицевой забор можно поменять на более эстетичный - из кирпичных столбов и профлиста.</p>
                        <br>
                        <p>Итак, в строительных фирмах средняя стоимость забора «под ключ» на нашем объеме -  1400 р/мп (профлист с полимерным покрытием на металлическом каркасе, высота 1,8м)</p>

                        <p>Длина забора по периметру участка – 114м. Стоимость забора – 160 тысяч рублей + калитка 7 тысяч + ворота 15 тысяч. Итого - 182 тысячи рублей.</p>

                        <p>Мы решили не заказывать забор «под ключ», а закупить материал самостоятельно. Средняя стоимость профнастила С8 – 250-300 руб/м2. Дешевле всего купить профлист в Москве можно было в Леруа Мерлен. За м2 профнастила С8 (полиэстеровое покрытие, цвет зеленый) просили 200 руб! (Но обратим внимание! Эта цена показалась нам крайне низкой. Мы пришли в магазин с толщиномером и микрометром. Тема будет разобрана в отдельной статье. Если вкратце, то толщина и цинковое покрытие этих листов не выдерживает никакой критики)</p>
                        
                        <p>На периметр ушло бы 215 м2 или 65 тысяч рублей (фольгу из Леруа не рассматриваем). Плюс столбы, цемент, щебень и расходники еще около 40 тысяч. Сумма немаленькая и раз уж мы решили экономить, стоит подумать.</p>
                        <br><br>
                        <img src="img/22.jpg" width="650" class="center" alt="" />
                        <br><br>
                        <p>В профессинальном строительстве профлист массово применяется в качестве временных ограждений. Например, в стройплощадках, пешеходных проходах. Причем эксплуатируется недолго и совершенно не теряет своих качеств. Стало быть профлист бу для забора можно недорого купить в Москве.</p> 

                        <p>Заходим на сервис stroy.sale. И да, Игорю повезло. Строительная компания распродавала остатки профлиста, нужно было быстро ехать и смотреть. На складе Игорь отбросил откровенно помятые листы. После отбора посмотрите, материал весьма достойный. </p>
                        <br><br>
                        <img src="img/23.jpg" width="650" class="center" alt="" />
                        <br><br>
                        <p>И сколько же стоили эти листы? 80 рублей/м2 или 40% от стоимости даже в Леруа Мерлен. Толщиной 0,45 а не фольга 0,3 мм. Неплохо! Кстати, на stroy.sale новый профлист также из остатков оптовых компаний стоил 180 руб/м2.</p>

                        <p>Щебень и смесь нашли также на сервисе  stroy.sale со скидкой 30% .Сразу заказываем доставку, т.к. ехать и смотреть этот материал смысла не было. Металлические столбы привозим с оптовой базы.</p>
                        <br><br>
                        <img src="img/24.jpg" width="650" class="center" alt="" />
                        <br><br>
                        <img src="img/25.jpg" width="650" class="center" alt="" />
                        <br><br>
                        <p>Цены по доставке стройматериалов в Москве колеблются от 500 руб/час  (частники) до 1500 руб/час (транспортные компании). В среднем 800 рублей. Материал нужно было забирать из трех разных мест и везти в область. Это заняло 4 часа и стоило 3000 рублей.</p>

                        <p>По монтажу Игорю не очень хотелось делать ямы и бетонировать столбы самостоятельно. Хотя аренда бура стоит не таких больших денег. Но по совету соседей он обратился к ребятам из Азии, которые согласились сделать это за 25 тысяч. Остальные работы Игорь решил делать самостоятельно.</p>

                        <p>Заглубление столбов в грунт приняли 0,7м. Да, это меньше глубины промерзания. Поэтому забор вместе с грунтом будет чуть подниматься и опускаться зимой-весной. Иногда это приводит к проблемам с открыванием калитки или ворот. Но вспоминаем, что забор с уличной стороны временный. А забор со стороны соседей не имеет калиток. Отличный план!</p>
                        <br><br>
                        <img src="img/26.jpg" width="650" class="center" alt="" />
                        <br><br>
                        <p>Теперь за работу. Не прошло и недели как ребята сделали по периметру ямы и поставили столбы с шагом 1,5 м. Еще за пару недель Игорь по вечерам и выходным варил каркас и прикручивал профлист. Дело сделано!</p>

                        <p>Денежные затраты на установку забора составили: 18000 профлист + 27000 столбы, бетон и щебень + 25000 рублей работа + 3000 доставка. Итого 73 000 рублей.</p>

                        <p>Вместо: 182 000 рублей.</p>

                        <p>Сэкономили 60% Неплохо для начала! В следующей статье перенесемся на год вперед и выберем Игорю керамогранитную плитку. Вам удачи и не переплачивайте за ремонт!</p>
                        `
                    },
                    {               
                        date : '03.07.2017',
                        title : 'Как закупить керамогранит со скидкой 30% и не развестись с женой',
                        text : `
                        <img src="img/31.jpg" width="650" class="center" alt="" />
                        <br><br>
                        <p>В предыдущей статье мы экономили на ограждении участка. Перепрыгнем на некоторое время вперед. И расскажем как Игорь с женой покупал керамогранит для внутренней отделки дома. Да, кстати у Игоря есть жена Татьяна и маленькая дочка. Так вот, чтобы закупить плитку максимально дешево, нужно было заранее определится с объемами и цветами. Чтобы, по возможности, дожидаться этих цветов на распродажах и товарных остатках. </p>

                        <p>В идеале, для этого нужен дизайн проект. На чем очень настаивала жена Игоря. Но с учетом стоимости дизайн проекта 50-100 тысяч и нашей цели – построить дом за полцены, было принято решение обойтись своими силами. Например, выбрать подходящий интерьер в журналах по дизайну. А также воспользоваться простыми бесплатными дизайн-программами (например, здесь: planner.pravilny.ru, roomstyler.com, armstrong.com). Татьяна так увлеклась, что построила 4 варианта дизайна и успела запутаться в них)</p>

                        <p>Тем временем Игорь в соответствии с планом дома посчитал требуемые объемы. Вот что получилось: санузел – 35 м2, пол прихожей - 14 м2 , пол кухни – 16  м2. </p>

                        <p>После нескольких вылазок в строймагазины, Татьяна для отделки санузла  выбрала керамогранит  «под дерево» KERAMA-MARAZZI Вяз Венге (купить в Москве можно за 880 руб/м2 ) и гилфорд (цена 470 руб/м2). На пол кухни и прихожей подошел матовый керамогранит Estima MR 01 (цена 900 руб/м2). Итого около 50 000 тысяч рублей. Плюс клей (10 мешков по 25 кг) и затирка (30 кг) еще 5000 рублей.</p>
                        <!--<img src="img/32.jpg" width="650" class="center" alt="" />
                        <img src="img/33.jpg" width="650" class="center" alt="" />
                        <img src="img/34.jpg" width="650" class="center" alt="" />-->

                        <p>Теперь оставалось следить за скидками. Параллельно Игорь зашел на сервис по продаже стройматериалов со скидками stroy.sale. По выбранным плиткам там было пусто, зато  плиточный клей Knauf Флизен Плюс и затирки продавали со скидкой 50% - покупаем сразу. Оплачиваем на сайте и заказываем доставку.</p>
                        <br><br>
                        <img src="img/35.jpg" width="650" class="center" alt="" />
                        <br><br>
                        <p>Через 3 недели, в к-раута нужная плитка гилфорд  на распродаже была со скидкой 20%. Купили. Еще через неделю в рассылке от stroy.sale Игорь увидел распродажу матовой плитки «керамика будущего этна» по цене 350 руб/м2. Едва ли можно так дешево купить керамогранит в Москве. Строительная компания занимающаяся монтажом фасадов распродавала нереализованные остатки керамогранита 600х600.  Причем толщиной 10мм, что как раз лучше для прихожей и кухни (повышенная прочность). Такая цена не могла не заинтересовать нас. Но не тут то было, Татьяна настаивала на своем цветовом решении с керамогранитом Эстима. Художник так видит)</p>
                        <br><br>
                        <img src="img/36.jpg" width="650" class="center" alt="" />
                        <br><br>
                        <p>Впрочем на следующих выходных семья снова отправилась по строительным гипермаркетам. Вживую сравнили керамогранит. Разница была не столь большой, поэтому приняли решение заказать на гостиную и прихожую керамику будущего. А керама марацци «под дерево» пришлось купить без скидки за 880 руб/м2. Время поджимало. </p>

                        <p>Итого на закупку керамогранитной плитки для внутренней отделки дома было потрачено 35 000 рублей. </p>

                       <p>Экономия 30%. И это снова неплохо! На сегодня все, в следующей статье узнаем как Игорь поставил перегородки из гипсокартона по цене картона) Удачи Вам и не переплачивайте за ремонт!</p>                 
                            `
                    }
                ],
                allPost : true
            }
        },
        watch : {

        },
        computed : {

        },
        mounted : function() {
            if (this.$route.params.id) {
                this.allPost = false;   
            }
        }, 
        methods : {
            clearArea : function() {
                this.allPost = false;
            }
        },
        filters: {
            textLength: function(val) {
                if (val.length > 50) {
                    val = val.replace(new RegExp("<p>",'g'),'');
                    val = val.replace(new RegExp("</p>",'g'),'');
                    val = val.replace('<img src="img/31.jpg" width="650" class="center" alt="" />','');
                    val = val.replace('<img src="img/21.jpg" width="650" class="center" alt="" />','');
                    val = val.replace('<img src="img/11.jpg" width="650" class="center" alt="" />','');
                    val = val.replace('<br>','');
                    val = val.replace('<b>','');
                    val = val.replace('<br> ','');
                    val = val.replace('</b>','');
                    return val.slice(0,550) + '...'
                }
            }
        }
    }
</script>